interview.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>interview</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-08-10 01:25:57 IST"/>
<meta name="author" content="habibnahas"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">interview</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Kalido </a>
<ul>
<li><a href="#sec-1_1">1.1 Testing Interview Questions </a>
<ul>
<li><a href="#sec-1_1_1">1.1.1 </a></li>
</ul>
</li>
<li><a href="#sec-1_2">1.2 API Testing </a>
<ul>
<li><a href="#sec-1_2_1">1.2.1 Main challenges </a></li>
<li><a href="#sec-1_2_2">1.2.2 Test cases based on </a></li>
<li><a href="#sec-1_2_3">1.2.3 Best Practices: API Testing </a></li>
<li><a href="#sec-1_2_4">1.2.4 Difference between api and unit testing </a></li>
</ul>
</li>
<li><a href="#sec-1_3">1.3 Questions </a>
<ul>
<li><a href="#sec-1_3_1">1.3.1 GM </a></li>
<li><a href="#sec-1_3_2">1.3.2 Manager </a></li>
<li><a href="#sec-1_3_3">1.3.3 Automation Lead </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Kalido </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Testing Interview Questions </h3>
<div class="outline-text-3" id="text-1_1">


</div>

<div id="outline-container-1_1_1" class="outline-4">
<h4 id="sec-1_1_1"><span class="section-number-4">1.1.1</span> </h4>
<div class="outline-text-4" id="text-1_1_1">

<p>1st round automation lead
2nd round manager 
3rd country head
puzzles in all 3 rounds
basic string comparisons
different types of testing
bug lifecycle
API testing questions
</p>
<p>
test fixture - the environmental configurations and dependencies or state that must be in place for a test to run
</p>
</div>
</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> API Testing </h3>
<div class="outline-text-3" id="text-1_2">


</div>

<div id="outline-container-1_2_1" class="outline-4">
<h4 id="sec-1_2_1"><span class="section-number-4">1.2.1</span> Main challenges </h4>
<div class="outline-text-4" id="text-1_2_1">

<ul>
<li>
Parameter selection
</li>
<li>
Parameter combination
</li>
<li>
Call sequencing

</li>
</ul>
</div>

</div>

<div id="outline-container-1_2_2" class="outline-4">
<h4 id="sec-1_2_2"><span class="section-number-4">1.2.2</span> Test cases based on </h4>
<div class="outline-text-4" id="text-1_2_2">

<ul>
<li>
Return value based on input condition
</li>
<li>
Does not return anything
</li>
<li>
Trigger some other API/event/interrupt
</li>
<li>
Update data structure
</li>
<li>
Modify certain resources
</li>
</ul>
</div>

</div>

<div id="outline-container-1_2_3" class="outline-4">
<h4 id="sec-1_2_3"><span class="section-number-4">1.2.3</span> Best Practices: API Testing </h4>
<div class="outline-text-4" id="text-1_2_3">

<ul>
<li id="sec-1_2_3_1">Planning <br/>
<ul>
<li>
think about what you will test and how you will be performing the test
</li>
<li>
Depending on complexity of task create test-specification or design document and have it peer reviewed
</li>
</ul>
</li>
<li id="sec-1_2_3_2">Organization <br/>
<ul>
<li>
Each test case should be self-contained and isolated from dependencies as possible, implies that test cases should be as simple as possible
</li>
<li>
test cases should be grouped by category, straight-line cases, boundary cases, null inputs and so forth
</li>
<li>
avoid test chaining
</li>
</ul>
</li>
<li id="sec-1_2_3_3">Priorities <br/>
<ul>
<li>
avoid jumping into invalid or "evil" tests that will cause crashes and other interesting problems
</li>
<li>
What are the conditions under which the API will be exercised the most(parameters,etc); test these effectively     

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1_2_4" class="outline-4">
<h4 id="sec-1_2_4"><span class="section-number-4">1.2.4</span> Difference between api and unit testing </h4>
<div class="outline-text-4" id="text-1_2_4">

<ul>
<li>
unit testing is done by developers, api by qa
</li>
<li>
unit testing typically exercises the smallest unit of code, api testing exercises larger functionality
</li>
<li>
api testing should consider the various alternative scenarios in which the code can be called by the end user
</li>
<li>
api testing is more extensive and consider the interaction between various modules within the application
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> Questions </h3>
<div class="outline-text-3" id="text-1_3">


</div>

<div id="outline-container-1_3_1" class="outline-4">
<h4 id="sec-1_3_1"><span class="section-number-4">1.3.1</span> GM </h4>
<div class="outline-text-4" id="text-1_3_1">

<ol>
<li>
Competitors to Kalido in India and worldwide
</li>
<li>
main customer base, how many in India
</li>
<li>
growth over the past few years/decade and in the coming decade
</li>
<li>
Product Portfolio over the years
</li>
<li>
Main reason for customers not implementing Kalido
</li>
<li>
5 years from now
</li>
<li>
Indian operations
</li>
</ol>
</div>

</div>

<div id="outline-container-1_3_2" class="outline-4">
<h4 id="sec-1_3_2"><span class="section-number-4">1.3.2</span> Manager </h4>
<div class="outline-text-4" id="text-1_3_2">

<ol>
<li>
How many products in kalido bangalore
</li>
<li>
How many teams for those products
</li>
<li>
Team strength
</li>
<li>
Where is development located
</li>
<li>
What is the process followed
</li>
<li>
Do engineers work across multiple teams
</li>
<li>
What is the hardware allocated to engineers
</li>
<li>
What kind of training opportunities does Kalido provide
</li>
<li>
How often are the release cycles
</li>
</ol>
</div>

</div>

<div id="outline-container-1_3_3" class="outline-4">
<h4 id="sec-1_3_3"><span class="section-number-4">1.3.3</span> Automation Lead </h4>
<div class="outline-text-4" id="text-1_3_3">

<ol>
<li>
What is automated
</li>
<li>
What is the automation stack used
</li>
<li>
How is the framework layered
</li>
<li>
What is the technology used
</li>
<li>
When is automation done
</li>
<li>
How many people in the automation team
</li>
<li>
What are the problems you are facing in automation

</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: habibnahas
</p>
<p class="date"> Date: 2010-08-10 01:25:57 IST</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 24</p>
</div>
</div>
</body>
</html>
